package lesson3.hw;

/**
 * GBJava3
 * Java Core. Professional level. 19.08.2019 Webinar. Teacher: Anton Batiaev
 * Урок 3. Средства ввода-вывода.
 * Домашняя работа.
 * @author Litvinenko Yuriy
 * 1. Добавить в сетевой чат запись локальной истории в текстовый файл на клиенте.
 * 2. После загрузки клиента показывать ему последние 100 строк чата.
 *
 * Дополнительно задание.
 * Прочитать файл (около 50 байт) в байтовый массив и вывести этот массив в консоль;
 * Последовательно сшить 5 файлов в один (файлы примерно 100 байт).
 * Может пригодиться следующая конструкция:
 * List<InputStream> al = new ArrayList<>(); ... Enumeration<InputStream> e = Collections.enumeration(al);
 * Написать консольное приложение, которое умеет постранично читать текстовые файлы (размером > 10 mb).
 * Вводим страницу (за страницу можно принять 1800 символов), программа выводит ее в консоль.
 * Контролируем время выполнения: программа не должна загружаться дольше 10 секунд,
 * а чтение – занимать свыше 5 секунд.
 */
public class Task1 {
}
